Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationPartInvalidConnection Property
 Fabrication Part connection invalid and could not be automatically coupled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationPartInvalidConnection { get; }
Public Shared ReadOnly Property FabricationPartInvalidConnection As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationPartInvalidConnection {
	FailureDefinitionId^ get ();
}
static member FabricationPartInvalidConnection : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace